<?php
echo "<p></p>","---------------------------------------------------------------------","<p></p>";
//session_start();
//$param1 = $_GET["param1"];
//$param2 = $_GET["param2"];
//$res = $param1 + $param2;
//$res1 = $param1 - $param2;
//$res2 = $param1 * $param2;
//$res3 = $param1 / $param2;
//$data= array('p1'=>$param1,'p2'=>$param2, 'res'=>$res, 'res1'=>$res1, 'res2'=>$res2, 'res3'=>$res3);
//$jsonString = json_encode($data);
//echo $jsonString;
//echo "test";
//echo "<p></p>";
//print("test");
//echo "<h1>Privet, server</h1>";
//
//$p = "servis";


//$data= array('p1'=>10,'p2'=>14);
//$sum1=0;
//foreach ($data as $key=>$value) {
//    echo $key.": ".$value."<br>";
//    $sum1+=$value;
//}
//echo "Сумма 1 цикла = ",$sum1;
//
//echo "<p></p>","---------------------------------------------------------------------","<p></p>";
//
//$sum2=0;
//$arr = array(1,2,3,4,5,6,7,8,9);
//for($i=0;$i<count($arr);$i++){
//    echo $arr[$i]."<br>";
//    $sum2+=$arr[$i];
//}
//echo "<p></p>","Сумма 2 цикла = ",$sum2;
//
//
//$a = 23;
//$b = 34;
//$c = 12;
//
//
//if ($a <= $b && $a <= $c) {
//    // $a самый маленький
//    $min = $a;
//    if ($b <= $c) {
//        // $b средний, $c самый большой
//        $mid = $b;
//        $max = $c;
//    } else {
//        // $c средний, $b самый большой
//        $mid = $c;
//        $max = $b;
//    }
//} elseif ($b <= $a && $b <= $c) {
//    // $b самый маленький
//    $min = $b;
//    if ($a <= $c) {
//        // $a средний, $c самый большой
//        $mid = $a;
//        $max = $c;
//    } else {
//        // $c средний, $a самый большой
//        $mid = $c;
//        $max = $a;
//    }
//} else {
//    // $c - самый маленький
//    $min = $c;
//    if ($a <= $b) {
//        // $a средний, $b самый большой
//        $mid = $a;
//        $max = $b;
//    } else {
//        // $b средний, $a самый большой
//        $mid = $b;
//        $max = $a;
//    }
//}
//echo "<p></p>",'Минимальное = ',' ',$min,' ','среднее = ',$mid,' ','Максимальное = ',$max;
//
//echo "<p></p>","---------------------------------------------------------------------","<p></p>";
//$sum3=0;
//
//$kv_array =[
//    [1,2,3],
//    [4,5,6],
//    [7,8,9]
//];
//for($i=0;$i<count($kv_array);$i++){
//    for($j=0;$j<count($kv_array[$i]);$j++){
//    $sum3+=$kv_array[$i][$j];
//    echo $kv_array[$i][$j]."<br>";
//    }
//}
//echo $sum3;
?>


<!--<h1>Privet,--><?php //echo $p; ?><!--</h1>-->


<?php
//                                24.02.2026
?>


<?php
echo "<p></p>","---------------------------------------------------------------------","<p></p>";


/**
 * 1
 * создать функцию вычесления квадрата числа, без использование встроеной функции
 *
 * 2
 * создать функцию,  которая определяет наибольшее знвечение из двух числе , без использование встроеной функции
 *
 * 3
 * создать функцию которая принимает в аргументе массив , определяет максимальный элемент и возращает его
 *
 * 4
 * создаь функцию которая вычесляет площадь круга или квадрата по заданым параметрам
 *
 * 5
 * создать функцию которая определяет длину Ассоциативного масива
 *
 */

//function kvadrata($w){
//    $otvet1=$w*$w;
//    return$otvet1;
//}echo'Ответ на 1 задание = ' , kvadrata(5) , "<br>";
//
//function naibolshee($one, $tvo){
//    if ($one <= $tvo) {
//        echo 'Ответ на 2 задание = ' , $tvo ,' больше чем ',$one, "<br>";
//    } else {
//        echo 'Ответ на 2 задание = ' , $one ,' больше чем ',$tvo, "<br>";
//    }
//}naibolshee(5,10);
//
//$array=[1,5,7,9,15,12,10];
//function max_array_chislo($a) {
//    echo'Ответ на 3 задание  = ' , max($a) , "<br>";
//}max_array_chislo($array);
//
//function kvadrata_ploshad($w){
//    $otvet1=$w*$w;
//    return$otvet1;
//}echo'Ответ на 4 задание Площаль квадрата = ' , kvadrata_ploshad(10) , "<br>";
//
//
//
//
//
//$words = array(
//    "red" => "красный",
//    "blue" => "синий",
//    "green" => "зеленый"
//);
//function lens_woeds($f){
//    return var_dump(sizeof($f));
//} echo 'Ответ на 5 задание длина Ассоциативного масива = ' , lens_woeds($words);
//
//








?>






